noless-zz/esp8266-led-strip-clock/src/main.cpp
function connectWifi() {
  const ssid = document.getElementById('ssidList').value;
  const pass = document.getElementById('wifiPass').value;
  const msg = document.getElementById('wifiMsg');
  if (!ssid) {
    msg.textContent = 'Select an SSID first';
    msg.className = 'status-msg status-err';
    return;
  }
  msg.textContent = `Connecting to ${ssid}...`;
  msg.className = 'status-msg';

  const pollConnect = (attempt = 0) => {
    fetch('/api/wifi/connect').then(r => r.json()).then(d => {
      if (d.connecting) {
        if (attempt > 60) {
          msg.textContent = 'Connection timeout';
          msg.className = 'status-msg status-err';
          return;
        }
        setTimeout(() => pollConnect(attempt + 1), 500);
        return;
      }

      if (d.connected) {
        msg.textContent = `Connected! Open http://${d.hostname}.local/ or ${d.ip}`;
        msg.className = 'status-msg status-ok';
      } else {
        msg.textContent = d.error || 'Connection failed';
        msg.className = 'status-msg status-err';
      }
      pollStatus();
    }).catch(() => {
      msg.textContent = 'Connection status check failed';
      msg.className = 'status-msg status-err';
    });
  };

  const p = new URLSearchParams({ ssid, pass });
  fetch('/api/wifi/connect?' + p.toString()).then(r => r.json()).then(d => {
    if (!d.connecting) {
      msg.textContent = d.error || 'Failed to start connection';
      msg.className = 'status-msg status-err';
      return;
    }
    pollConnect();
  }).catch(() => {
    msg.textContent = 'Connection request failed';
    msg.className = 'status-msg status-err';
  });
}

// Poll status
function pollStatus() {
  fetch('/api/status').then(r => r.json()).then(d => {
    document.getElementById('heap').textContent = Math.round(d.heap / 1024) + ' KB';
    document.getElementById('apSsid').textContent = d.ap_ssid || '-';
    document.getElementById('host').textContent = d.hostname ? (d.hostname + '.local') : '-';
    document.getElementById('ip').textContent = d.ip || '-';
    document.getElementById('powerToggle').classList.toggle('on', d.power);
    document.getElementById('brightness').value = d.brightness;
    document.getElementById('brVal').textContent = d.brightness;
    document.getElementById('speed').value = d.speed;
    document.getElementById('spVal').textContent = d.speed;
    document.querySelectorAll('.fx-btn').forEach((b, i) => b.classList.toggle('active', i === d.effect));
  }).catch(() => {});
}
pollStatus();
scanWifi();
setInterval(pollStatus, 5000);
</script>
</body>
</html>
)rawliteral";

// ─── Setup ───────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  Serial.println("\n\n=== LED Controller Starting ===");

  buildDeviceIdentity();
  setupLEDs();
  setupWiFi();
  setupDNS();
  setupMDNS();
  setupOTA();
  setupWebServer();

  Serial.println("=== Ready! AP: " + apSsid + " / Host: " + localHostname + ".local ===");
}

void loop() {
  dnsServer.processNextRequest();
  if (mdnsStarted) {
    MDNS.update();
  } else if (WiFi.status() == WL_CONNECTED) {
    setupMDNS();
  }
  updateWiFiConnect();
  ArduinoOTA.handle();
  updateLEDs();
}

void buildDeviceIdentity() {
  String mac = WiFi.macAddress();
  mac.replace(":", "");
  deviceId = mac.substring(mac.length() - 6);
  deviceId.toUpperCase();
  apSsid = String(AP_SSID_BASE) + "-" + deviceId;
  localHostname = String("ledportal-") + deviceId;
  localHostname.toLowerCase();
}

// ─── WiFi AP ─────────────────────────────────────────────
void setupWiFi() {
  WiFi.persistent(true);
  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(localHostname.c_str());
  WiFi.softAP(apSsid.c_str(), AP_PASS);
  delay(100);
  Serial.print("AP IP: ");
  Serial.println(WiFi.softAPIP());

  if (WiFi.SSID().length() > 0 && beginWiFiConnectAttempt(8000, false)) {
    WiFi.begin(); // try saved STA credentials (non-blocking)
    Serial.println("Trying saved STA credentials...");
  }
}

// ─── DNS (Captive Portal) ────────────────────────────────
void setupDNS() {
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    return;
  }
  // Redirect all DNS queries to our IP → captive portal
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
}

void setupMDNS() {
  if (WiFi.status() != WL_CONNECTED || mdnsStarted) {
    return;
  }
  if (MDNS.begin(localHostname.c_str())) {
    mdnsStarted = true;
    Serial.print("mDNS: http://");
    Serial.print(localHostname);
    Serial.println(".local");
  } else {
    Serial.println("mDNS start failed");
  }
}

// ─── OTA ─────────────────────────────────────────────────
void setupOTA() {
  ArduinoOTA.setHostname(localHostname.c_str());
  ArduinoOTA.setPassword(OTA_PASS);
  ArduinoOTA.onStart([]() {
    FastLED.clear(true);
    Serial.println("OTA Start");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    uint8_t pct = progress / (total / 100);
    int litLeds = map(pct, 0, 100, 0, NUM_LEDS);
    FastLED.clear();
    for (int i = 0; i < litLeds; i++) {
      leds[i] = CRGB(0, 255, 0);
    }
    FastLED.show();
  });
  ArduinoOTA.onEnd([]() {
    fill_solid(leds, NUM_LEDS, CRGB::Green);
    FastLED.show();
    Serial.println("OTA Done!");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    fill_solid(leds, NUM_LEDS, CRGB::Red);
    FastLED.show();
    Serial.printf("OTA Error[%u]\n", error);
  });
  ArduinoOTA.begin();
}

// ─── LEDs ────────────────────────────────────────────────
void setupLEDs() {
  FastLED.addLeds<WS2812, LED_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(state.brightness);
  FastLED.clear(true);
}

void updateLEDs() {
  if (!state.power) {
    EVERY_N_MILLISECONDS(100) {
      FastLED.clear(true);
    }
    return;
  }

  unsigned long interval = map(state.speed, 1, 255, 60, 5);
  unsigned long now = millis();
  if (now - lastUpdate < interval) return;
  lastUpdate = now;

  switch (state.effect) {
    case 0: effectSolid();    break;
    case 1: effectRainbow();  break;
    case 2: effectChase();    break;
    case 3: effectBreathe();  break;
    case 4: effectFire();     break;
    case 5: effectTwinkle();  break;
    case 6: effectWave();     break;
    case 7: effectGradient(); break;
  }
  FastLED.show();
}

// ─── Effects ─────────────────────────────────────────────
void effectSolid() {
  fill_solid(leds, NUM_LEDS, state.color1);
}

void effectRainbow() {
  fill_rainbow(leds, NUM_LEDS, effectHue++, 7);
}

void effectChase() {
  fadeToBlackBy(leds, NUM_LEDS, 40);
  int pos = beatsin16(map(state.speed, 1, 255, 10, 100), 0, NUM_LEDS - 1);
  leds[pos] = state.color1;
}

void effectBreathe() {
  uint8_t val = beatsin8(map(state.speed, 1, 255, 10, 60), 30, 255);
  CRGB c = state.color1;
  c.nscale8(val);
  fill_solid(leds, NUM_LEDS, c);
}

void effectFire() {
  static byte heat[NUM_LEDS];
  // Cool down
  for (int i = 0; i < NUM_LEDS; i++) {
    heat[i] = qsub8(heat[i], random8(0, ((55 * 10) / NUM_LEDS) + 2));
  }
  // Heat drifts up
  for (int k = NUM_LEDS - 1; k >= 2; k--) {
    heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2]) / 3;
  }
  // Ignite
  if (random8() < 160) {
    int y = random8(7);
    heat[y] = qadd8(heat[y], random8(160, 255));
  }
  // Map to colors
  for (int j = 0; j < NUM_LEDS; j++) {
    leds[j] = HeatColor(heat[j]);
  }
}

